snlkuharlocal/src/DataProcessors/b2b_ОбменДанныхПоAPI/b2b_ОбменДанныхПоAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>b2b_ОбменДанныхПоAPI</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСкидокКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзменийУсловийРаботы</name>
    <type>
      <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УстановкаСкидокПоКонтрагентам/УстановкаСкидокПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидокПоКонтрагентам</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКонечныйПокупатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВУ</name>
    <comment>Номер водительского удостоверения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение (Периодический реквизит)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительныйПадеж</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АссистентМенеджера</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПодразделенияУСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомерСотрудникаЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускВездеход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПродаж</name>
    <comment>Работник склада забронирован данным подразделением ЦО</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобренСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Банки/Банки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Банки</name>
  <comment>(Общ) Классификатор банков</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоррСчет</name>
    <comment>(Регл) Корреспонденский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/b2b_ОбменДанныхПоAPI/ObjectModule.bsl
#Область ОсновныеПроцедурыИФункции
                   
Процедура ВыполнитьВыгрузкуАкций(
		ЗапроситьСтатусВыгрузкиАкцийНаПортал = Ложь,
		ВыгрузитьАкцииНаПортал = Ложь,
		ПолнаяВыгрузка = Ложь
	) Экспорт
	
	ТипЗапроса = "ВыгрузкаАкций";
	СтруктураПодключения = b2b_ОбменДаннымиПоAPI.ПолучитьСтруктуруПодключения();
	СтруктураПодключения.Вставить("ТипЗапроса", ТипЗапроса);
	
	Если ЗапроситьСтатусВыгрузкиАкцийНаПортал Тогда
		ВыполнитьЗапросСтатусовВыгрузкиДанныхНаПортал(СтруктураПодключения);
	КонецЕсли;
	//++Данилова Е.В. 24.07.2025  HELP-6121 
	//оставляем только полную выгрузку, изменения выгружаются сразу на портал при записи акции 
	//Если ВыгрузитьАкцииНаПортал Тогда
	Если ВыгрузитьАкцииНаПортал 
		И ПолнаяВыгрузка Тогда
		//--Данилова Е.В. 24.07.2025
		СтруктураПодключения.Вставить("ПолнаяВыгрузка", ПолнаяВыгрузка); 
		ВыполнитьВыгрузкуАкцииНаПортал(СтруктураПодключения);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуКонтрагентов(
		ЗапроситьСтатусВыгрузкиКонтрагентовНаПортал = Ложь, 
		ВыгрузитьКонтрагентовНаПортал = Ложь,
		ПолнаяВыгрузка = Ложь
	) Экспорт
	
	ТипЗапроса = "ВыгрузкаКонтрагентов";
	СтруктураПодключения = b2b_ОбменДаннымиПоAPI.ПолучитьСтруктуруПодключения();
	СтруктураПодключения.Вставить("ТипЗапроса", ТипЗапроса);
	
	Если ЗапроситьСтатусВыгрузкиКонтрагентовНаПортал Тогда
		ВыполнитьЗапросСтатусовВыгрузкиДанныхНаПортал(СтруктураПодключения);
	КонецЕсли;
	
	Если ВыгрузитьКонтрагентовНаПортал Тогда
		СтруктураПодключения.Вставить("ПолнаяВыгрузка", ПолнаяВыгрузка); 
		ВыполнитьВыгрузкуКонтрагентовНаПортал(СтруктураПодключения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗапросСтатусовВыгрузкиДанныхНаПортал(СтруктураПодключения)
	
	b2b_ОбменДаннымиПоAPI.ПолучитьРезультатОбработкиОчередиНаПортале(СтруктураПодключения);

КонецПроцедуры

Процедура ВыполнитьВыгрузкуКонтрагентовНаПортал(СтруктураПодключения)
	
	// получение списка контрагентов из узла плана обмена
	Если Не СтруктураПодключения.ПолнаяВыгрузка Тогда
		
		СтруктураИзменений = b2b_ОбменДаннымиПоAPI.ПолучитьВсеИзмененияИзПланаОбмена(
			СтруктураПодключения.Узел, 
			"Контрагенты"
		);
		
		Если СтруктураИзменений = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокКонтрагентов = СтруктураИзменений.Данные;
		
		Если СписокКонтрагентов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втВсеКонтрагентыДляОбработки
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В(&Контрагенты)
		|	И Контрагенты.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|	И Контрагенты.Владелец = &Интегральная
		|	И НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.НеИспользовать
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ведущий
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Ведущие
		|		ПО (Контрагенты.Ведущий = Ведущие.Ссылка)
		|ГДЕ
		|	Контрагенты.Ссылка В(&Контрагенты)
		|	И Контрагенты.Владелец <> &Интегральная
		|	И НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.НеИспользовать
		|	И Ведущие.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|;";
		
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втВсеКонтрагентыДляОбработки
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Владелец = &Интегральная
		|	И ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|	И НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.НеИспользовать
		|;";
		
	КонецЕсли;
	
	// получение выборки данных для отправки на портал
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Контрагенты.Код, """") КАК Код,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА НЕ Контрагенты.НеИспользовать
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ, ЛОЖЬ) КАК Активность,
		|	ЕСТЬNULL(Контрагенты.Наименование, """") КАК Наименование,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(Контрагенты.ЕМэйл1 КАК СТРОКА(100))) <> """"
		|			ТОГДА ВЫРАЗИТЬ(Контрагенты.ЕМэйл1 КАК СТРОКА(100))
		|		ИНАЧЕ ВЫБОР
		|				КОГДА (ВЫРАЗИТЬ(Контрагенты.ЕМэйл2 КАК СТРОКА(100))) <> """"
		|					ТОГДА ВЫРАЗИТЬ(Контрагенты.ЕМэйл2 КАК СТРОКА(100))
		|				ИНАЧЕ """"
		|			КОНЕЦ
		|	КОНЕЦ КАК ЕМэйл,
		|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИНН,
		|	ЕСТЬNULL(Контрагенты.РаботаСМаркированнымТоваромПодтверждена, """") КАК РаботаСМаркированнымТоваром,
		|	"""" КАК ВторичнаяВалюта,
		|	ЕСТЬNULL(ФизЛицоМенеджер.Код, """") КАК КодМенеджер,
		|	ЕСТЬNULL(ФизЛицоМенеджер.Наименование, """") КАК НаименованиеМенеджер,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ФизЛицоМенеджер.ЕМэйл КАК СТРОКА(100)), """") КАК ЕМэйлМенеджер,
		|	ЕСТЬNULL(ФизЛицоАссистент.Код, """") КАК КодАссистент,
		|	ЕСТЬNULL(ФизЛицоАссистент.Наименование, """") КАК НаименованиеАссистент,
		|	ВЫБОР
		|		КОГДА ФизЛицоАссистент.ЕМэйл ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ВЫРАЗИТЬ(ФизЛицоАссистент.ЕМэйл КАК СТРОКА(100))
		|	КОНЕЦ КАК ЕМэйлАссистент,
		|	ЕСТЬNULL(ФизЛицоУправляющийТерритории.Код, """") КАК КодУправляющийТерритории,
		|	ЕСТЬNULL(ФизЛицоУправляющийТерритории.Наименование, """") КАК НаименованиеУправляющийТерритории,
		|	ВЫБОР
		|		КОГДА ФизЛицоУправляющийТерритории.ЕМэйл ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ВЫРАЗИТЬ(ФизЛицоУправляющийТерритории.ЕМэйл КАК СТРОКА(100))
		|	КОНЕЦ КАК ЕМэйлУправляющийТерритории,
		|	"""" КАК Дистрибьюторы,
		|	втВсеКонтрагентыДляОбработки.Ссылка КАК Ссылка,
		|	ГруппаПользователя.Код КАК КодКаналСбыта,
		|	ГруппаПользователя.Наименование КАК НаименованиеКаналСбыта,
		|	ЕСТЬNULL(Контрагенты.ИННИностранногоКонтрагента, """") КАК ИННИностранногоКонтрагента
		|ПОМЕСТИТЬ втОсновныеДанные
		|ИЗ
		|	втВсеКонтрагентыДляОбработки КАК втВсеКонтрагентыДляОбработки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛицоМенеджер
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛицоАссистент
		|				ПО ФизЛицоМенеджер.АссистентМенеджера = ФизЛицоАссистент.Ссылка
		|			ПО Контрагенты.Менеджер = ФизЛицоМенеджер.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛицоУправляющийТерритории
		|			ПО Контрагенты.УправляющийТерритории = ФизЛицоУправляющийТерритории.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КаналСбыта КАК ГруппаПользователя
		|			ПО Контрагенты.КаналСбыта1 = ГруппаПользователя.Ссылка
		|		ПО втВсеКонтрагентыДляОбработки.Ссылка = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Контрагенты.Код, """") КАК КодЮрЛицо,
		|	ВЫБОР
		|		КОГДА НЕ Контрагенты.НеИспользовать
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктивностьЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.Наименование, """") КАК НаименованиеЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.Ссылка, """") КАК СсылкаЮрЛицо,
		|	"""" КАК ДиректорЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИННЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.ОГРН, """") КАК ОГРНЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.ЮридическийАдрес, """") КАК ЮридическийАдресЮрЛицо,
		|	ЕСТЬNULL(Контрагенты.Телефоны, """") КАК ТелефоныЮрЛицо,
		|	ЕСТЬNULL(БанковскиеСчета.НомерСчета, """") КАК РасчетныйСчетЮрЛицо,
		|	ЕСТЬNULL(Банки.Наименование, """") КАК БанкЮрЛицо,
		|	ЕСТЬNULL(Банки.КоррСчет, """") КАК КоррСчетЮрЛицо,
		|	ЕСТЬNULL(Банки.Код, """") КАК БИКЮрЛицо,
		|	Контрагенты.РаботаСМаркированнымТоваромПодтверждена КАК РаботаСМаркировкойЮрЛицо,
		|	втОсновныеДанные.Код КАК Код,
		|	втОсновныеДанные.Активность КАК Активность,
		|	втОсновныеДанные.Наименование КАК Наименование,
		|	втОсновныеДанные.ЕМэйл КАК ЕМэйл,
		|	втОсновныеДанные.ИНН КАК ИНН,
		|	втОсновныеДанные.РаботаСМаркированнымТоваром КАК РаботаСМаркированнымТоваром,
		|	втОсновныеДанные.ВторичнаяВалюта КАК ВторичнаяВалюта,
		|	втОсновныеДанные.КодМенеджер КАК КодМенеджер,
		|	втОсновныеДанные.НаименованиеМенеджер КАК НаименованиеМенеджер,
		|	втОсновныеДанные.ЕМэйлМенеджер КАК ЕМэйлМенеджер,
		|	втОсновныеДанные.КодАссистент КАК КодАссистент,
		|	втОсновныеДанные.НаименованиеАссистент КАК НаименованиеАссистент,
		|	ЕСТЬNULL(втОсновныеДанные.ЕМэйлАссистент, """") КАК ЕМэйлАссистент,
		|	втОсновныеДанные.КодУправляющийТерритории КАК КодУправляющийТерритории,
		|	втОсновныеДанные.НаименованиеУправляющийТерритории КАК НаименованиеУправляющийТерритории,
		|	втОсновныеДанные.ЕМэйлУправляющийТерритории КАК ЕМэйлУправляющийТерритории,
		|	втОсновныеДанные.Дистрибьюторы КАК Дистрибьюторы,
		|	втОсновныеДанные.Ссылка КАК Ссылка,
		|	втОсновныеДанные.КодКаналСбыта КАК КодКаналСбыта,
		|	втОсновныеДанные.НаименованиеКаналСбыта КАК НаименованиеКаналСбыта,
		|	ЕСТЬNULL(Контрагенты.ИННИностранногоКонтрагента, """") КАК ИННЮрЛицаИностранногоКонтрагента,
		|	втОсновныеДанные.ИННИностранногоКонтрагента КАК ИННИностранногоКонтрагента
		|ИЗ
		|	втОсновныеДанные КАК втОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|				ПО БанковскиеСчета.Банк = Банки.Ссылка
		|			ПО Контрагенты.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО втОсновныеДанные.Ссылка = Контрагенты.Ведущий
		|ИТОГИ
		|	МАКСИМУМ(Код),
		|	МАКСИМУМ(Активность),
		|	МАКСИМУМ(Наименование),
		|	МАКСИМУМ(ЕМэйл),
		|	МАКСИМУМ(ИНН),
		|	МАКСИМУМ(РаботаСМаркированнымТоваром),
		|	МАКСИМУМ(ВторичнаяВалюта),
		|	МАКСИМУМ(КодМенеджер),
		|	МАКСИМУМ(НаименованиеМенеджер),
		|	МАКСИМУМ(ЕМэйлМенеджер),
		|	МАКСИМУМ(КодАссистент),
		|	МАКСИМУМ(НаименованиеАссистент),
		|	МАКСИМУМ(ЕМэйлАссистент),
		|	МАКСИМУМ(КодУправляющийТерритории),
		|	МАКСИМУМ(НаименованиеУправляющийТерритории),
		|	МАКСИМУМ(ЕМэйлУправляющийТерритории),
		|	МАКСИМУМ(Дистрибьюторы),
		|	МАКСИМУМ(КодКаналСбыта),
		|	МАКСИМУМ(НаименованиеКаналСбыта)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ФизическиеЛица.Код, """") КАК КодТерриториальныйМенеджер,
		|	ЕСТЬNULL(ФизическиеЛица.Наименование, """") КАК НаименованиеТерриториальныйМенеджер,
		|	ЕСТЬNULL(ФизическиеЛица.ЕМэйл, """") КАК ЕМэйлТерриториальныйМенеджер,
		|	втОсновныеДанные.Ссылка КАК Ссылка
		|ИЗ
		|	втОсновныеДанные КАК втОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ТерриториальныеМенеджеры КАК КонтрагентыТерриториальныеМенеджеры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|			ПО КонтрагентыТерриториальныеМенеджеры.ТерриториальныйМенеджер = ФизическиеЛица.Ссылка
		|		ПО втОсновныеДанные.Ссылка = КонтрагентыТерриториальныеМенеджеры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НоменклатураСкидки.Наименование, """") КАК НаименованиеСкидки,
		|	ЕСТЬNULL(СкидкиКонтрагентов.Скидка, """") КАК ПроцентСкидки,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(НоменклатураСкидки.Код КАК СТРОКА(30)) ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ""ttd"" + (ВЫРАЗИТЬ(НоменклатураСкидки.Код КАК СТРОКА(30)))
		|	КОНЕЦ КАК ТипТовараДляСкидки,
		|	втОсновныеДанные.Ссылка КАК Ссылка
		|ИЗ
		|	втОсновныеДанные КАК втОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСкидки
		|			ПО СкидкиКонтрагентов.Номенклатура = НоменклатураСкидки.Ссылка
		|		ПО втОсновныеДанные.Ссылка = СкидкиКонтрагентов.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	втОсновныеДанные.Ссылка КАК Ведущий
		|ПОМЕСТИТЬ втСписокЮрЛиц
		|ИЗ
		|	втОсновныеДанные КАК втОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО втОсновныеДанные.Ссылка = Контрагенты.Ведущий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПунктыДоставки.Код КАК КодПунктыДоставки,
		|	ВЫБОР
		|		КОГДА НЕ ПунктыДоставки.НеИспользовать
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктивностьПунктыДоставки,
		|	ВЫБОР
		|		КОГДА ПунктыДоставки.Код = ОсновнойПунктДоставкиКонтрагента.Код
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОсновнойПунктДоставки,
		|	ПунктыДоставки.Наименование КАК НаименованиеПунктДоставки,
		|	ЕСТЬNULL(Регионы.Наименование, """") КАК РегионПунктДоставки,
		|	ВЫБОР
		|		КОГДА ПунктыДоставки.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Перегруз)
		|			ТОГДА ЕСТЬNULL(ПунктыДоставки.АдресАнтор.Наименование, """")
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ПунктыДоставки.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.ТранспортнаяКомпания)
		|					ТОГДА ЕСТЬNULL(ПунктыДоставки.ПунктПерегруза.Наименование, """")
		|				ИНАЧЕ ВЫРАЗИТЬ(ПунктыДоставки.АдресПолучателя КАК СТРОКА(150))
		|			КОНЕЦ
		|	КОНЕЦ КАК АдресПунктДоставки,
		|	ПунктыДоставки.ТипДоставки КАК ТипДоставкиПунктДоставки,
		|	втСписокЮрЛиц.Ведущий КАК Ведущий,
		|	втСписокЮрЛиц.Ссылка КАК СсылкаЮрЛицо,
		|	ЕСТЬNULL(ТранспКомпания.Код, """") КАК КодТранспортнойКомпании,
		|	ЕСТЬNULL(ТранспКомпания.Наименование, """") КАК НаименованиеТранспортнойКомпании
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПунктыДоставки КАК ОсновнойПунктДоставкиКонтрагента
		|			ПО Контрагенты.ОсновнойПунктДоставки = ОсновнойПунктДоставкиКонтрагента.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСписокЮрЛиц КАК втСписокЮрЛиц
		|			ПО (втСписокЮрЛиц.Ссылка = Контрагенты.Ссылка)
		|		ПО ПунктыДоставки.Владелец = Контрагенты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Регионы КАК Регионы
		|		ПО ПунктыДоставки.Регион = Регионы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ТранспКомпания
		|		ПО ПунктыДоставки.ТраспортнаяКомпания = ТранспКомпания.Ссылка
		|ГДЕ
		|	НЕ ПунктыДоставки.ПометкаУдаления
		|	И НЕ Контрагенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Интегральная", Справочники.ИБ.НайтиПоКоду("SMN"));
	Запрос.УстановитьПараметр("Контрагенты", СписокКонтрагентов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// если нет ни одного контрагента - выходим
	Если РезультатЗапроса[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// обработка выборки данных, сериализация в строку JSON 
	
	// общая структура, в которой будет находится весь запрос
	ОбщаяСтруктураДанных = Новый Структура;
	СтруктураМассивовКонтрагентов = Новый Структура;	
	
	//// группы пользователей
	//ВыборкаГруппыПользователя = РезультатЗапроса[2].Выбрать();
	
	// контрагенты, управляющие территорией, ассистент менеджера, юр.лица
	ВыборкаКонтрагенты = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// территориальные менеджеры	
	ВыборкаТерриториальныеМенеджеры = РезультатЗапроса[3].Выбрать(); 
	
	// персональные скидки	
	ВыборкаПерсональныеСкидки = РезультатЗапроса[4].Выбрать(); 
	
	// пункты доставки юр.лиц	
	ВыборкаПунктыДоставки = РезультатЗапроса[6].Выбрать();

	МассивКонтрагентов = Новый Массив;
	
	Пока ВыборкаКонтрагенты.Следующий() Цикл 
		
		Если ВыборкаКонтрагенты.ЕМэйл = "" Тогда
			
			// электронная почта обязательное поле для отправки данных на портал
			// если эл.почта не заполнена - фиксируем ошибку и пропускаем обработку
			b2b_ОбменДаннымиПоAPI.ЗаписатьОшибкуОбменДаннымиПоAPI(
				СтруктураПодключения.ИдентификаторЗапроса, 
				, 
				СтрШаблон("У контрагента с кодом %1 не заполнено обязательное поле электронная почта", ВыборкаКонтрагенты.Код)
			);
			Продолжить;
			
		КонецЕсли;
		
		// основные поля контрагента
		СтруктураКонтрагент = Новый Структура;
		СтруктураКонтрагент.Вставить("login", ВыборкаКонтрагенты.Код);
		СтруктураКонтрагент.Вставить("active", ВыборкаКонтрагенты.Активность);
		СтруктураКонтрагент.Вставить("name", ВыборкаКонтрагенты.Наименование);
		СтруктураКонтрагент.Вставить("email", ВыборкаКонтрагенты.ЕМэйл);
		//++Данилова Е.В. 25.08.2025 без задачи 
		Если ЗначениеЗаполнено(ВыборкаКонтрагенты.ИННИностранногоКонтрагента) Тогда
			СтруктураКонтрагент.Вставить("inn", ВыборкаКонтрагенты.ИННИностранногоКонтрагента);
		Иначе 	
			СтруктураКонтрагент.Вставить("inn", ВыборкаКонтрагенты.ИНН);
		КонецЕсли;
		//СтруктураКонтрагент.Вставить("inn", ВыборкаКонтрагенты.ИНН); 
		//--Данилова Е.В. 25.08.2025
		
		// ответственный менеджер
		Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодМенеджер) Тогда
			СтруктураОтветственныйМенеджер = Новый Структура;
			СтруктураОтветственныйМенеджер.Вставить("code", ВыборкаКонтрагенты.КодМенеджер); 
			СтруктураОтветственныйМенеджер.Вставить("name", ВыборкаКонтрагенты.НаименованиеМенеджер); 
			СтруктураОтветственныйМенеджер.Вставить("email", ВыборкаКонтрагенты.ЕМэйлМенеджер);
			СтруктураКонтрагент.Вставить("responsibleManager", СтруктураОтветственныйМенеджер);
		КонецЕсли;
		
		// ассистен менеджера
		Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодАссистент) Тогда
			СтруктураАссистентМенеджера = Новый Структура;
			СтруктураАссистентМенеджера.Вставить("code", ВыборкаКонтрагенты.КодАссистент);
			СтруктураАссистентМенеджера.Вставить("name", ВыборкаКонтрагенты.НаименованиеАссистент);
			СтруктураАссистентМенеджера.Вставить("email", ВыборкаКонтрагенты.ЕМэйлАссистент);
			СтруктураКонтрагент.Вставить("managerAssistant", СтруктураАссистентМенеджера);
		КонецЕсли;
		
		// группы пользователей
		МассивГруппПользователя = Новый Массив;
		Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодКаналСбыта) Тогда 
			ГруппаПользователя = Новый Структура;
			ГруппаПользователя.Вставить("code", ВыборкаКонтрагенты.КодКаналСбыта); 
			ГруппаПользователя.Вставить("name", ВыборкаКонтрагенты.НаименованиеКаналСбыта);
			МассивГруппПользователя.Добавить(ГруппаПользователя);
		КонецЕсли;
		Если МассивГруппПользователя.Количество() > 0 Тогда
			СтруктураКонтрагент.Вставить("userGroups", МассивГруппПользователя);
		КонецЕсли;
		
		// управляющий территорией
		Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодУправляющийТерритории) Тогда
			СтруктураУправляющийТерриторией = Новый Структура;
			СтруктураУправляющийТерриторией.Вставить("code", ВыборкаКонтрагенты.КодУправляющийТерритории); 
			СтруктураУправляющийТерриторией.Вставить("name", ВыборкаКонтрагенты.НаименованиеУправляющийТерритории);
			СтруктураУправляющийТерриторией.Вставить("email", ВыборкаКонтрагенты.ЕМэйлУправляющийТерритории);
			СтруктураКонтрагент.Вставить("chiefTerritoryManager", СтруктураУправляющийТерриторией);
		КонецЕсли;
		
		// территориальные менеджеры
		ВыборкаТерриториальныеМенеджеры.Сбросить();
		МассивТерриториальныхМенеджеров = Новый Массив;
		Пока ВыборкаТерриториальныеМенеджеры.Следующий() Цикл
			Если ВыборкаТерриториальныеМенеджеры.Ссылка = ВыборкаКонтрагенты.Ссылка Тогда
				Если ЗначениеЗаполнено(ВыборкаТерриториальныеМенеджеры.КодТерриториальныйМенеджер) Тогда
					СтруктураТерриториальныйМенеджер = Новый Структура;
					СтруктураТерриториальныйМенеджер.Вставить("code", ВыборкаТерриториальныеМенеджеры.КодТерриториальныйМенеджер);
					СтруктураТерриториальныйМенеджер.Вставить("name", ВыборкаТерриториальныеМенеджеры.НаименованиеТерриториальныйМенеджер);
					СтруктураТерриториальныйМенеджер.Вставить("email", ВыборкаТерриториальныеМенеджеры.ЕМэйлТерриториальныйМенеджер); 
					МассивТерриториальныхМенеджеров.Добавить(СтруктураТерриториальныйМенеджер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивТерриториальныхМенеджеров.Количество() > 0 Тогда
			СтруктураКонтрагент.Вставить("territoryManagers", МассивТерриториальныхМенеджеров);
		КонецЕсли;
		
		// дистрибьюторов не передаем (даже пустой массив) 
		
		// территориальные скидки
		ВыборкаПерсональныеСкидки.Сбросить();
		МассивТерриториальныеСкидки = Новый Массив;
		Пока ВыборкаПерсональныеСкидки.Следующий() Цикл
			Если ВыборкаПерсональныеСкидки.Ссылка = ВыборкаКонтрагенты.Ссылка Тогда
				Если ЗначениеЗаполнено(ВыборкаПерсональныеСкидки.НаименованиеСкидки) Тогда
					СтруктураПерсональныеСкидки = Новый Структура;
					СтруктураПерсональныеСкидки.Вставить("name", ВыборкаПерсональныеСкидки.НаименованиеСкидки);
					СтруктураПерсональныеСкидки.Вставить("discount", ВыборкаПерсональныеСкидки.ПроцентСкидки);
					СтруктураПерсональныеСкидки.Вставить("tipTovDiscount", ВыборкаПерсональныеСкидки.ТипТовараДляСкидки); 
					МассивТерриториальныеСкидки.Добавить(СтруктураПерсональныеСкидки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивТерриториальныеСкидки.Количество() > 0 Тогда
			СтруктураКонтрагент.Вставить("personalDiscounts", МассивТерриториальныеСкидки);
		КонецЕсли;
		
		// юридические лица
		ВыборкаЮрЛица = ВыборкаКонтрагенты.Выбрать();
		МассивЮрЛиц = Новый Массив;
		РаботаСМаркировкой = Ложь;
		
		Пока ВыборкаЮрЛица.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаЮрЛица.КодЮрЛицо) Тогда
				
				СтруктураПрофильЮридическогоЛица = Новый Структура;
				СтруктураПрофильЮридическогоЛица.Вставить("code", ВыборкаЮрЛица.КодЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("active", ВыборкаЮрЛица.АктивностьЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("name", ВыборкаЮрЛица.НаименованиеЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("director", ВыборкаЮрЛица.ДиректорЮрЛицо);
				//++Данилова Е.В. 25.08.2025 без задачи 
				Если ЗначениеЗаполнено(ВыборкаЮрЛица.ИННЮрЛицаИностранногоКонтрагента) Тогда
				   СтруктураПрофильЮридическогоЛица.Вставить("inn", ВыборкаЮрЛица.ИННЮрЛицаИностранногоКонтрагента);
				Иначе	
				   СтруктураПрофильЮридическогоЛица.Вставить("inn", ВыборкаЮрЛица.ИННЮрЛицо);
				КонецЕсли;
				//СтруктураПрофильЮридическогоЛица.Вставить("inn", ВыборкаЮрЛица.ИННЮрЛицо); 
				//--Данилова Е.В. 25.08.2025 
				СтруктураПрофильЮридическогоЛица.Вставить("ogrn", ВыборкаЮрЛица.ОГРНЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("legalAddress", ВыборкаЮрЛица.ЮридическийАдресЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("phone", ВыборкаЮрЛица.ТелефоныЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("accountNumber", ВыборкаЮрЛица.РасчетныйСчетЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("bank", ВыборкаЮрЛица.БанкЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("correspondentBankAccount", ВыборкаЮрЛица.КоррСчетЮрЛицо);
				СтруктураПрофильЮридическогоЛица.Вставить("bik", ВыборкаЮрЛица.БИКЮрЛицо); 
				СтруктураПрофильЮридическогоЛица.Вставить("worksWithLabeling", ВыборкаЮрЛица.РаботаСМаркировкойЮрЛицо);
				
				Если ВыборкаЮрЛица.РаботаСМаркировкойЮрЛицо Тогда
					РаботаСМаркировкой = ВыборкаЮрЛица.РаботаСМаркировкойЮрЛицо;
				КонецЕсли;
				
				// пункты доставки юр.лиц
				МассивПунктыДоставки = Новый Массив;
				
				ВыборкаПунктыДоставки.Сбросить();
				
				Пока ВыборкаПунктыДоставки.Следующий() Цикл
					
					Если ВыборкаПунктыДоставки.Ведущий = ВыборкаКонтрагенты.Ссылка Тогда
						
						Если ВыборкаПунктыДоставки.СсылкаЮрЛицо <> ВыборкаЮрЛица.СсылкаЮрЛицо Тогда
							Продолжить;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ВыборкаПунктыДоставки.КодПунктыДоставки) Тогда
							
							СтруктураПунктыДоставки = Новый Структура;
							СтруктураПунктыДоставки.Вставить("code", ВыборкаПунктыДоставки.КодПунктыДоставки); 
							СтруктураПунктыДоставки.Вставить("active", ВыборкаПунктыДоставки.АктивностьПунктыДоставки); 
							СтруктураПунктыДоставки.Вставить("isMain", ВыборкаПунктыДоставки.ОсновнойПунктДоставки);
							СтруктураПунктыДоставки.Вставить("name", ВыборкаПунктыДоставки.НаименованиеПунктДоставки);
							СтруктураПунктыДоставки.Вставить("region", ВыборкаПунктыДоставки.РегионПунктДоставки);
							СтруктураПунктыДоставки.Вставить("address", XMLСтрока(ВыборкаПунктыДоставки.АдресПунктДоставки));
							
							// тип доставки
							МТипыДоставок=Новый соответствие;
							МтипыДоставок.Вставить("Доставка","DOSTAVKA");
							МтипыДоставок.Вставить("ТранспортнаяКомпания","TRANSCORP");
							МтипыДоставок.Вставить("Самовывоз","SAMOVYVOZ");
							МтипыДоставок.Вставить("Перегруз","PEREGRUZ");
							
							ТипДоставки = ВыборкаПунктыДоставки.ТипДоставкиПунктДоставки;
							Если Не ЗначениеЗаполнено(ТипДоставки) Тогда
								ТипДоставки = "";
							КонецЕсли;
							ТипДоставкиСиноним = XMLСтрока(ТипДоставки);
							ТИпДоставкиДляСтруктуры = МтипыДоставок.Получить(ТипДоставкиСиноним); 
							СтруктураТипДоставки = Новый Структура;
							СтруктураТипДоставки.Вставить("code", ?(ТИпДоставкиДляСтруктуры = Неопределено, "", ТИпДоставкиДляСтруктуры)); 
							СтруктураТипДоставки.Вставить("name", Строка(ТипДоставкиСиноним));
							
							СтруктураПунктыДоставки.Вставить("deliveryType", СтруктураТипДоставки); 
							
							// транспортная компания
							Если ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
							 
								Если ЗначениеЗаполнено(ВыборкаПунктыДоставки.КодТранспортнойКомпании) Тогда
									
									СтруктураТранспортнаяКомпания = Новый Структура;
									СтруктураТранспортнаяКомпания.Вставить("code", ВыборкаПунктыДоставки.КодТранспортнойКомпании); 
									СтруктураТранспортнаяКомпания.Вставить("name", ВыборкаПунктыДоставки.НаименованиеТранспортнойКомпании);
									
									СтруктураПунктыДоставки.Вставить("tk", СтруктураТранспортнаяКомпания);
									
								КонецЕсли; 
								
							КонецЕсли;
							
							МассивПунктыДоставки.Добавить(СтруктураПунктыДоставки);
						
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если МассивПунктыДоставки.Количество() > 0 Тогда
					СтруктураПрофильЮридическогоЛица.Вставить("deliveries", МассивПунктыДоставки);
				КонецЕсли;
				
				МассивЮрЛиц.Добавить(СтруктураПрофильЮридическогоЛица);
			
			КонецЕсли;
			
		КонецЦикла;
		// работа с маркированным товаром 
		СтруктураКонтрагент.Вставить("worksWithLabeling", РаботаСМаркировкой);
		
		Если МассивЮрЛиц.Количество() > 0 Тогда
			СтруктураКонтрагент.Вставить("profiles", МассивЮрЛиц);
		КонецЕсли;
		
		МассивКонтрагентов.Добавить(СтруктураКонтрагент);
		
	КонецЦикла;
	
	Если МассивКонтрагентов.Количество() > 0 Тогда
		// для отладки, комментарий не удалять
		// params структура queueable false
		//СтруктураОтладки = Новый Структура;
		//СтруктураОтладки.Вставить("queueable", false);
		//СтруктураМассивовКонтрагентов.Вставить("params", СтруктураОтладки); 
		//
		СтруктураМассивовКонтрагентов.Вставить("users", МассивКонтрагентов);
		ОбщаяСтруктураДанных.Вставить("data", СтруктураМассивовКонтрагентов);
	Иначе
		Возврат;
	КонецЕсли;
	
	СтруктураПодключения.Вставить("Данные", СписокКонтрагентов);
	
	ОтправитьВыгружаемыеДанныеНаПорталПоAPI(СтруктураПодключения, ОбщаяСтруктураДанных);
	
КонецПроцедуры

Процедура ВыполнитьЗапросСтатусовВыгрузкиАкцийНаПортал(СтруктураПодключения)

КонецПроцедуры

Процедура ВыполнитьВыгрузкуАкцииНаПортал(СтруктураПодключения)
	
	// определяем, что будет выгружено на портал
	СписокДокументовУстановкаСкидокПоКонтрагентам = Неопределено;
	
	Если Не СтруктураПодключения.ПолнаяВыгрузка Тогда
		СтруктураИзменений = b2b_ОбменДаннымиПоAPI.ПолучитьВсеИзмененияИзПланаОбмена(
			СтруктураПодключения.Узел, 
			"УстановкаСкидокПоКонтрагентам"
		);
		
		Если СтруктураИзменений = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокДокументовУстановкаСкидокПоКонтрагентам = СтруктураИзменений.Данные;
		
		Если СписокДокументовУстановкаСкидокПоКонтрагентам.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПодключения.Вставить("Данные", СписокДокументовУстановкаСкидокПоКонтрагентам);
	
	// получаем струкуру для отправки на портал
	СтруктураДляВыгрузкиАкций = ПолучитьСтруктуруДляВыгрузкиАкций(СтруктураПодключения);
	
	Если СтруктураДляВыгрузкиАкций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// создаем соединение и отправляем данные
	ОтправитьВыгружаемыеДанныеНаПорталПоAPI(СтруктураПодключения, СтруктураДляВыгрузкиАкций);
	
КонецПроцедуры 
//Данилова Е.В. 23.07.2025 HELP-6121
Процедура ОтправитьВыгружаемыеДанныеНаПорталПоAPI(СтруктураПодключения, СтруктураДляВыгрузкиНаПортал, РезультатОтправки = Ложь)  Экспорт 
	
	// создаем соединение
	СоединениеHTTP = b2b_ОбменДаннымиПоAPI.HTTPСоединениеДляОбменаДаннымиAPI(СтруктураПодключения);
	
	HTTPзапрос = Новый HTTPзапрос();
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", СтруктураПодключения.КлючАвторизации);
	
	HTTPЗапрос.Заголовки = ЗаголовокHTTP;
	
	// записываем в РС b2b_ЗапросыНаОбновлениеВОчереди, ТипЗапроса = "ВыгрузкаАкций" 
	ВходныеПараметры = Новый Структура;
	//ВходныеПараметры.Вставить("ИдентификаторОчереди", Структура_JSON_Ответ.requestId); 
	ВходныеПараметры.Вставить("ТипЗапроса", СтруктураПодключения.ТипЗапроса);
	
	Если СтруктураПодключения.ТипЗапроса = "ВыгрузкаКонтрагентов" Тогда
		HTTPзапрос.АдресРесурса = СтруктураПодключения.МетодAPIВыгрузитьКонтрагентов;
	ИначеЕсли СтруктураПодключения.ТипЗапроса = "ВыгрузкаАкций" Тогда
		HTTPзапрос.АдресРесурса = СтруктураПодключения.МетодAPIВыгрузитьАкции;	
	КонецЕсли;
	
	ВходныеПараметры.Вставить("Данные", СтруктураПодключения.Данные);
	
	ТекстЗапроса = b2b_ОбменДаннымиПоAPI.СериализоватьВСтрокуJSON(СтруктураДляВыгрузкиНаПортал);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	// отправка данных на портал и записываем в журнал: b2b_ЗапросыНаОбновлениеИстория
	Попытка
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		// записываем ошибку в лог РС b2b_ЖурналОшибок
        b2b_ОбменДаннымиПоAPI.ЗаписатьОшибкуОбменДаннымиПоAPI(
			СтруктураПодключения.ИдентификаторЗапроса, 
			, 
			ОписаниеОшибки()
		);
		Возврат;
	КонецПопытки;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	РезультатЧтенияJSON = b2b_ОбменЗаявками.СтруктураJSONЗапроса(Ответ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;
	
	b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(
		Строка(СтруктураПодключения.ИдентификаторЗапроса), 
		//++Данилова Е.В. 24.07.2025 HELP-6121
		?(Структура_JSON_Ответ <> неопределено И Структура_JSON_Ответ.Свойство("requestId"),Структура_JSON_Ответ.requestId,""),
		//--Данилова Е.В. 24.07.2025
		ТекстЗапроса, 
		ВходныеПараметры, 
		СтруктураПодключения.ХранитьПодробностиЛогирования
	); 

	// Смирнов М.Ю. 04.08.2025 HELP-6165 начало
	ИдентификаторКлиентаДляЗаписиВРС = "";
	Если Структура_JSON_Ответ <> Неопределено И Структура_JSON_Ответ.Свойство("requestId") Тогда
		ИдентификаторКлиентаДляЗаписиВРС = Структура_JSON_Ответ.requestId;
	КонецЕсли;
	b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
		Строка(СтруктураПодключения.ИдентификаторЗапроса),
		ИдентификаторКлиентаДляЗаписиВРС,
		Новый Структура("РезультатJson, ИдентификаторОчереди", Структура_JSON_Ответ, ""),
		,
		,
		Ложь,
		СтруктураПодключения.ХранитьПодробностиЛогирования
	);
	// Смирнов М.Ю. 04.08.2025 HELP-6165 конец
	
	//++Данилова Е.В. 23.07.2025 HELP-6121
	РезультатОтправки = Ответ.КодСостояния = 200; 
	//--Данилова Е.В. 23.07.2025
	
КонецПроцедуры

Функция ПолучитьСтруктуруДляВыгрузкиАкций(СтруктураПодключения) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Не СтруктураПодключения.ПолнаяВыгрузка Тогда
		УсловиеЗапроса = 
		" ГДЕ
		|	УстановкаСкидокПоКонтрагентам.Проведен = ИСТИНА
		|	И УстановкаСкидокПоКонтрагентам.Ссылка В(&СписокДокументов)";
		Запрос.УстановитьПараметр("СписокДокументов", СтруктураПодключения.Данные);
	Иначе
		УсловиеЗапроса = 
		" ГДЕ
		|	УстановкаСкидокПоКонтрагентам.Проведен = ИСТИНА
		|	И УстановкаСкидокПоКонтрагентам.Дата <= &ДатаНачалоДня
		|	И УстановкаСкидокПоКонтрагентам.Дата2 >= &ДатаКонецДня";
	КонецЕсли;
	
	ОбщаяСтруктураВыгружаемыхСкидок = Новый Структура;
	ВнутренняяСтруктураДанных = Новый Структура;
	МассивСкидок = Новый Массив;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка,
		|	УстановкаСкидокПоКонтрагентам.Номер КАК Номер,
		|	УстановкаСкидокПоКонтрагентамСкидки.Номенклатура КАК Номенклатура,
		|	УстановкаСкидокПоКонтрагентамСкидки.Скидка КАК Скидка,
		|	УстановкаСкидокПоКонтрагентамСкидки.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель,
		|	ВЫРАЗИТЬ(УстановкаСкидокПоКонтрагентам.Комментарий КАК СТРОКА(100)) КАК Наименование,
		|	УстановкаСкидокПоКонтрагентам.Дата КАК ДатаНачала,
		|	УстановкаСкидокПоКонтрагентам.Дата2 КАК ДатаОкончания
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам.Скидки КАК УстановкаСкидокПоКонтрагентамСкидки
		|		ПО УстановкаСкидокПоКонтрагентам.Ссылка = УстановкаСкидокПоКонтрагентамСкидки.Ссылка  
		|"+ УсловиеЗапроса +" ; 
		//++Данилова Е.В. 21.04.2026 HELP-9390 
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	НоменклатураГруппа.Код КАК КодМодели,
		//|	втДанные.Скидка КАК Скидка,
		//|	втДанные.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель,
		//|	втДанные.Номер КАК Номер,
		//|	втДанные.Наименование КАК Наименование,
		//|	НАЧАЛОПЕРИОДА(втДанные.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		//|	КОНЕЦПЕРИОДА(втДанные.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
		//|ИЗ
		//|	Справочник.Номенклатура КАК СпрНоменлатура
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураГруппа
		//|		ПО СпрНоменлатура.Родитель = НоменклатураГруппа.Ссылка
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанные КАК втДанные
		////++Данилова Е.В. 22.01.2026  HELP-8618
		////|		ПО (СпрНоменлатура.Ссылка В ИЕРАРХИИ
		////|				(ВЫБРАТЬ
		////|					втДанные.Номенклатура КАК Номенклатура
		////|				ИЗ
		////|					втДанные КАК втДанные))
		////|ГДЕ 
		//|ПО  втДанные.Номенклатура = НоменклатураГруппа.ссылка
		//
		//
		//
		//
		//| ГДЕ СпрНоменлатура.Ссылка В ИЕРАРХИИ
		//|		(ВЫБРАТЬ
		//|			втДанные.Номенклатура КАК Номенклатура
		//|		ИЗ
		//|			втДанные КАК втДанные)
		//|   И 
		////--Данилова Е.В. 22.01.2026
		//|	СпрНоменлатура.ПометкаУдаления = ЛОЖЬ
		//|	И СпрНоменлатура.ЭтоГруппа = ЛОЖЬ
		//|	И ВЫБОР
		//|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		//|				ТОГДА ""Да""
		//|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		//|				ТОГДА ""Нет""
		//|			ИНАЧЕ ВЫБОР
		//|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		//|						ТОГДА ""Да""
		//|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		//|						ТОГДА ""Нет""
		//|					ИНАЧЕ ВЫБОР
		//|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		//|								ТОГДА ""Да""
		//|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		//|								ТОГДА ""Нет""
		//|							ИНАЧЕ ВЫБОР
		//|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		//|										ТОГДА ""Да""
		//|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		//|										ТОГДА ""Нет""
		//|									ИНАЧЕ ""Нет""
		//|								КОНЕЦ
		//|						КОНЕЦ
		//|				КОНЕЦ
		//|		КОНЕЦ = ""Да""
		//|ИТОГИ
		//|	МАКСИМУМ(Наименование),
		//|	МАКСИМУМ(ДатаНачала),
		//|	МАКСИМУМ(ДатаОкончания)
		//|ПО
		//|	Номер
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		| ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураГруппа.Код КАК КодМодели,
		|	ВЫБОР
		|		КОГДА НЕ втДанные.Скидка ЕСТЬ NULL
		|			ТОГДА втДанные.Скидка
		|		КОГДА НЕ втДанные1.Скидка ЕСТЬ NULL
		|			ТОГДА втДанные1.Скидка
		|		КОГДА НЕ втДанные2.Скидка ЕСТЬ NULL
		|			ТОГДА втДанные2.Скидка
		|		КОГДА НЕ втДанные3.Скидка ЕСТЬ NULL
		|			ТОГДА втДанные3.Скидка
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Скидка,
		|	ВЫБОР
		|		КОГДА НЕ втДанные.СкидкаКонечныйПокупатель ЕСТЬ NULL
		|			ТОГДА втДанные.СкидкаКонечныйПокупатель
		|		КОГДА НЕ втДанные1.СкидкаКонечныйПокупатель ЕСТЬ NULL
		|			ТОГДА втДанные1.СкидкаКонечныйПокупатель
		|		КОГДА НЕ втДанные2.СкидкаКонечныйПокупатель ЕСТЬ NULL
		|			ТОГДА втДанные2.СкидкаКонечныйПокупатель
		|		КОГДА НЕ втДанные3.СкидкаКонечныйПокупатель ЕСТЬ NULL
		|			ТОГДА втДанные3.СкидкаКонечныйПокупатель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СкидкаКонечныйПокупатель,
		|	ВЫБОР
		|		КОГДА НЕ втДанные.Номер ЕСТЬ NULL
		|			ТОГДА втДанные.Номер
		|		КОГДА НЕ втДанные1.Номер ЕСТЬ NULL
		|			ТОГДА втДанные1.Номер
		|		КОГДА НЕ втДанные2.Номер ЕСТЬ NULL
		|			ТОГДА втДанные2.Номер
		|		КОГДА НЕ втДанные3.Номер ЕСТЬ NULL
		|			ТОГДА втДанные3.Номер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Номер,
		|	ВЫБОР
		|		КОГДА НЕ втДанные.Наименование ЕСТЬ NULL
		|			ТОГДА втДанные.Наименование
		|		КОГДА НЕ втДанные1.Наименование ЕСТЬ NULL
		|			ТОГДА втДанные1.Наименование
		|		КОГДА НЕ втДанные2.Наименование ЕСТЬ NULL
		|			ТОГДА втДанные2.Наименование
		|		КОГДА НЕ втДанные3.Наименование ЕСТЬ NULL
		|			ТОГДА втДанные3.Наименование
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА НЕ НАЧАЛОПЕРИОДА(втДанные.ДатаНачала, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(втДанные.ДатаНачала, ДЕНЬ)
		|		КОГДА НЕ НАЧАЛОПЕРИОДА(втДанные1.ДатаНачала, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(втДанные1.ДатаНачала, ДЕНЬ)
		|		КОГДА НЕ НАЧАЛОПЕРИОДА(втДанные2.ДатаНачала, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(втДанные2.ДатаНачала, ДЕНЬ)
		|		КОГДА НЕ НАЧАЛОПЕРИОДА(втДанные3.ДатаНачала, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(втДанные3.ДатаНачала, ДЕНЬ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА НЕ КОНЕЦПЕРИОДА(втДанные.ДатаОкончания, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА КОНЕЦПЕРИОДА(втДанные.ДатаОкончания, ДЕНЬ)
		|		КОГДА НЕ КОНЕЦПЕРИОДА(втДанные1.ДатаОкончания, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА КОНЕЦПЕРИОДА(втДанные1.ДатаОкончания, ДЕНЬ)
		|		КОГДА НЕ КОНЕЦПЕРИОДА(втДанные2.ДатаОкончания, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА КОНЕЦПЕРИОДА(втДанные2.ДатаОкончания, ДЕНЬ)
		|		КОГДА НЕ КОНЕЦПЕРИОДА(втДанные3.ДатаОкончания, ДЕНЬ) ЕСТЬ NULL
		|			ТОГДА КОНЕЦПЕРИОДА(втДанные3.ДатаОкончания, ДЕНЬ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменлатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураГруппа
		|		ПО СпрНоменлатура.Родитель = НоменклатураГруппа.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные
		|		ПО (втДанные.Номенклатура = НоменклатураГруппа.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные1
		|		ПО (втДанные1.Номенклатура = НоменклатураГруппа.Родитель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные2
		|		ПО (втДанные2.Номенклатура = НоменклатураГруппа.Родитель.Родитель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные3
		|		ПО (втДанные3.Номенклатура = НоменклатураГруппа.Родитель.Родитель.Родитель)
		|ГДЕ
		|	СпрНоменлатура.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				втДанные.Номенклатура КАК Номенклатура
		|			ИЗ
		|				втДанные КАК втДанные)
		|	И СпрНоменлатура.ПометкаУдаления = ЛОЖЬ
		|	И СпрНоменлатура.ЭтоГруппа = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|				ТОГДА ""Да""
		|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|				ТОГДА ""Нет""
		|			ИНАЧЕ ВЫБОР
		|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|						ТОГДА ""Да""
		|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|						ТОГДА ""Нет""
		|					ИНАЧЕ ВЫБОР
		|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|								ТОГДА ""Да""
		|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|								ТОГДА ""Нет""
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|										ТОГДА ""Да""
		|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|										ТОГДА ""Нет""
		|									ИНАЧЕ ""Нет""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ = ""Да""
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураГруппа.Код
		|ИТОГИ
		|	МАКСИМУМ(Наименование),
		|	МАКСИМУМ(ДатаНачала),
		|	МАКСИМУМ(ДатаОкончания)
		|ПО
		|	Номер; 
		//--Данилова Е.В. 21.04.2026 
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ведущие.Код КАК КодКонтрагента,
		|	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован КАК УчавствуетВАкции,
		|	втДанные.Номер КАК Номер
		|ИЗ
		|	втДанные КАК втДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Ведущие
		|				ПО Контрагенты.Ведущий = Ведущие.Ссылка
		|			ПО УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент = Контрагенты.Ссылка
		|		ПО втДанные.Ссылка = УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка
		|ГДЕ
		|	Ведущие.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)";
	
	Запрос.УстановитьПараметр("ДатаКонецДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаНачалоДня", КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[1].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаАкции = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаАкции.Следующий() Цикл
		
		СтруктураСкидок = Новый Структура;
		
		СтруктураСкидок.Вставить("code", ВыборкаАкции.Номер);
		СтруктураСкидок.Вставить("name", ВыборкаАкции.Наименование);
		СтруктураСкидок.Вставить("startDate", Формат(ВыборкаАкции.ДатаНачала, "ДФ='dd.MM.yyyy HH:mm:ss'"));
		СтруктураСкидок.Вставить("endDate", Формат(ВыборкаАкции.ДатаОкончания, "ДФ='dd.MM.yyyy HH:mm:ss'"));
		
		ВыборкаСкидки = ВыборкаАкции.Выбрать();
		
		МассивНоменклатуры = Новый Массив;
		
		Пока ВыборкаСкидки.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаСкидки.КодМодели) Тогда
				СтруктураТоваров = Новый Структура;
				СтруктураТоваров.Вставить("code", ВыборкаСкидки.КодМодели);
				СтруктураТоваров.Вставить("discountDistr", ВыборкаСкидки.Скидка);
				СтруктураТоваров.Вставить("discountClient", ВыборкаСкидки.СкидкаКонечныйПокупатель);
				МассивНоменклатуры.Добавить(СтруктураТоваров);
			КонецЕсли;
		
		КонецЦикла;
		
		Если МассивНоменклатуры.Количество() > 0 Тогда
			СтруктураСкидок.Вставить("products", МассивНоменклатуры);
		КонецЕсли;
		
		ВыборкаКонтрагенты.Сбросить();
		МассивКонтрагентов = Новый Массив;
		
		Пока ВыборкаКонтрагенты.Следующий() Цикл
		                                     
			Если ВыборкаКонтрагенты.Номер = ВыборкаАкции.Номер Тогда
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодКонтрагента) Тогда
					СтруктураКонтрагента = Новый Структура;
					СтруктураКонтрагента.Вставить("distr", ВыборкаКонтрагенты.КодКонтрагента); 
					СтруктураКонтрагента.Вставить("active", ВыборкаКонтрагенты.УчавствуетВАкции);
					МассивКонтрагентов.Добавить(СтруктураКонтрагента);	
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если МассивКонтрагентов.Количество() > 0 Тогда
			СтруктураСкидок.Вставить("distributors", МассивКонтрагентов);
		КонецЕсли;
		
		МассивСкидок.Добавить(СтруктураСкидок);
		
	КонецЦикла; 
	
	ВнутренняяСтруктураДанных.Вставить("deepDiscounts", МассивСкидок);
	ОбщаяСтруктураВыгружаемыхСкидок.Вставить("data", ВнутренняяСтруктураДанных);
	
	Возврат ОбщаяСтруктураВыгружаемыхСкидок;
	
КонецФункции

#КонецОбласти
